qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F405/at32f405rx.h
/**
  **************************************************************************
  * @file    at32f405rx.h
  * @author  Artery Technology & HorrorTroll & Zhaqian
  * @version v2.1.0
  * @date    27-Aug-2024
  * @brief   AT32F405Rx header file.
  *
  **************************************************************************
  *                       Copyright notice & Disclaimer
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup at32f405rx
  * @{
  */

#ifndef __AT32F405Rx_H
#define __AT32F405Rx_H

#ifdef __cplusplus
 extern "C" {
#endif

/**
  * @brief CMSIS Device version number V2.1.0
  */
#define __AT32F405_LIBRARY_VERSION_MAJOR   (0x02) /*!< [31:24] major version */
#define __AT32F405_LIBRARY_VERSION_MIDDLE  (0x01) /*!< [23:16] middle version */
#define __AT32F405_LIBRARY_VERSION_MINOR   (0x00) /*!< [15:8]  minor version */
#define __AT32F405_LIBRARY_VERSION_RC      (0x00) /*!< [7:0]   release candidate */
#define __AT32F405_LIBRARY_VERSION         ((__AT32F405_LIBRARY_VERSION_MAJOR  << 24)\
                                           |(__AT32F405_LIBRARY_VERSION_MIDDLE << 16)\
                                           |(__AT32F405_LIBRARY_VERSION_MINOR  << 8 )\
                                           |(__AT32F405_LIBRARY_VERSION_RC))

/**
  * @}
  */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */

/**
  * @brief Configuration of the Cortex-M4 Processor and Core Peripherals
 */
#define __CM4_REV                  0x0001U  /*!< Core Revision r0p1                           */
#define __MPU_PRESENT              1U       /*!< AT32 devices provide an MPU                  */
#define __NVIC_PRIO_BITS           4U       /*!< AT32 uses 4 Bits for the Priority Levels     */
#define __Vendor_SysTickConfig     0U       /*!< Set to 1 if different SysTick Config is used */
#define __FPU_PRESENT              1U       /*!< AT32 devices provide an FPU                  */

/**
  * @}
  */

/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */

/**
 * @brief AT32F405Rx Interrupt Number Definition, according to the selected device
 *        in @ref Library_configuration_section
 */

 /*!< Interrupt Number Definition */
typedef enum
{
/******  Cortex-M4 Processor Exceptions Numbers ***************************************************/
  Reset_IRQn                  = -15,    /*!< 1 Reset Vector Interrupt                             */
  NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                             */
  HardFault_IRQn              = -13,    /*!< 3 Cortex-M4 Hard Fault Interrupt                     */
  MemoryManagement_IRQn       = -12,    /*!< 4 Cortex-M4 Memory Management Interrupt              */
  BusFault_IRQn               = -11,    /*!< 5 Cortex-M4 Bus Fault Interrupt                      */
  UsageFault_IRQn             = -10,    /*!< 6 Cortex-M4 Usage Fault Interrupt                    */
  SVCall_IRQn                 = -5,     /*!< 11 Cortex-M4 SV Call Interrupt                       */
  DebugMonitor_IRQn           = -4,     /*!< 12 Cortex-M4 Debug Monitor Interrupt                 */
  PendSV_IRQn                 = -2,     /*!< 14 Cortex-M4 Pend SV Interrupt                       */
  SysTick_IRQn                = -1,     /*!< 15 Cortex-M4 System Tick Interrupt                   */

/******  AT32 specific Interrupt Numbers **********************************************************/
  WWDT_IRQn                   = 0,      /*!< Window WatchDog Timer Interrupt                      */
  PVM_IRQn                    = 1,      /*!< PVM Interrupt linked to EXINT16                      */
  TAMPER_IRQn                 = 2,      /*!< Tamper Interrupt linked to EXINT21                   */
  ERTC_WKUP_IRQn              = 3,      /*!< ERTC Wake Up Interrupt linked to EXINT22             */
  FLASH_IRQn                  = 4,      /*!< FLASH global Interrupt                               */
  CRM_IRQn                    = 5,      /*!< CRM global Interrupt                                 */
  EXINT0_IRQn                 = 6,      /*!< EXINT Line 0 Interrupt                               */
  EXINT1_IRQn                 = 7,      /*!< EXINT Line 1 Interrupt                               */
  EXINT2_IRQn                 = 8,      /*!< EXINT Line 2 Interrupt                               */
  EXINT3_IRQn                 = 9,      /*!< EXINT Line 3 Interrupt                               */
  EXINT4_IRQn                 = 10,     /*!< EXINT Line 4 Interrupt                               */
  DMA1_Channel1_IRQn          = 11,     /*!< DMA1 Channel 1 global Interrupt                      */
  DMA1_Channel2_IRQn          = 12,     /*!< DMA1 Channel 2 global Interrupt                      */
  DMA1_Channel3_IRQn          = 13,     /*!< DMA1 Channel 3 global Interrupt                      */
  DMA1_Channel4_IRQn          = 14,     /*!< DMA1 Channel 4 global Interrupt                      */
  DMA1_Channel5_IRQn          = 15,     /*!< DMA1 Channel 5 global Interrupt                      */
  DMA1_Channel6_IRQn          = 16,     /*!< DMA1 Channel 6 global Interrupt                      */
  DMA1_Channel7_IRQn          = 17,     /*!< DMA1 Channel 7 global Interrupt                      */
  ADC1_IRQn                   = 18,     /*!< ADC1 global Interrupt                                */
  CAN1_TX_IRQn                = 19,     /*!< CAN1 TX Interrupt                                    */
  CAN1_RX0_IRQn               = 20,     /*!< CAN1 RX0 Interrupt                                   */
  CAN1_RX1_IRQn               = 21,     /*!< CAN1 RX1 Interrupt                                   */
  CAN1_SE_IRQn                = 22,     /*!< CAN1 SE Interrupt                                    */
  EXINT9_5_IRQn               = 23,     /*!< EXINT Line[9:5] Interrupts                           */
  TMR1_BRK_TMR9_IRQn          = 24,     /*!< TMR1 Break Interrupt and TMR9 global Interrupt       */
  TMR1_OVF_TMR10_IRQn         = 25,     /*!< TMR1 Overflow Interrupt and TMR10 global Interrupt   */
  TMR1_TRG_HALL_TMR11_IRQn    = 26,     /*!< TMR1 Trigger and Hall Interrupt and TMR11 global IRQ */
  TMR1_CH_IRQn                = 27,     /*!< TMR1 Channel Interrupt                               */
  TMR2_GLOBAL_IRQn            = 28,     /*!< TMR2 global Interrupt                                */
  TMR3_GLOBAL_IRQn            = 29,     /*!< TMR3 global Interrupt                                */
  TMR4_GLOBAL_IRQn            = 30,     /*!< TMR4 global Interrupt                                */
  I2C1_EVT_IRQn               = 31,     /*!< I2C1 Event Interrupt                                 */
  I2C1_ERR_IRQn               = 32,     /*!< I2C1 Error Interrupt                                 */
  I2C2_EVT_IRQn               = 33,     /*!< I2C2 Event Interrupt                                 */
  I2C2_ERR_IRQn               = 34,     /*!< I2C2 Error Interrupt                                 */
  SPI1_IRQn                   = 35,     /*!< SPI1 global Interrupt                                */
  SPI2_IRQn                   = 36,     /*!< SPI2 global Interrupt                                */
  USART1_IRQn                 = 37,     /*!< USART1 global Interrupt                              */
  USART2_IRQn                 = 38,     /*!< USART2 global Interrupt                              */
  USART3_IRQn                 = 39,     /*!< USART3 global Interrupt                              */
  EXINT15_10_IRQn             = 40,     /*!< EXINT Line[15:10] Interrupts                         */
  ERTCAlarm_IRQn              = 41,     /*!< ERTC Alarm Interrupt linked to EXINT17               */
  OTGFS_WKUP_IRQn             = 42,     /*!< OTGFS Wake Up Interrupt linked to EXINT18            */
  TMR13_GLOBAL_IRQn           = 44,     /*!< TMR13 global Interrupt                               */
  TMR14_GLOBAL_IRQn           = 45,     /*!< TMR14 global Interrupt                               */
  SPI3_IRQn                   = 51,     /*!< SPI3 global Interrupt                                */
  USART4_IRQn                 = 52,     /*!< USART4 global Interrupt                              */
  USART5_IRQn                 = 53,     /*!< USART5 global Interrupt                              */
  TMR6_GLOBAL_IRQn            = 54,     /*!< TMR6 global Interrupt                                */
  TMR7_GLOBAL_IRQn            = 55,     /*!< TMR7 global Interrupt                                */
  DMA2_Channel1_IRQn          = 56,     /*!< DMA2 Channel 1 global Interrupt                      */
  DMA2_Channel2_IRQn          = 57,     /*!< DMA2 Channel 2 global Interrupt                      */
  DMA2_Channel3_IRQn          = 58,     /*!< DMA2 Channel 3 global Interrupt                      */
  DMA2_Channel4_IRQn          = 59,     /*!< DMA2 Channel 4 global Interrupt                      */
  DMA2_Channel5_IRQn          = 60,     /*!< DMA2 Channel 5 global Interrupt                      */
  OTGFS_IRQn                  = 67,     /*!< OTGFS global Interrupt                               */
  DMA2_Channel6_IRQn          = 68,     /*!< DMA2 Channel 6 global Interrupt                      */
  DMA2_Channel7_IRQn          = 69,     /*!< DMA2 Channel 7 global Interrupt                      */
  USART6_IRQn                 = 71,     /*!< USART6 global Interrupt                              */
  I2C3_EVT_IRQn               = 72,     /*!< I2C3 Event Interrupt                                 */
  I2C3_ERR_IRQn               = 73,     /*!< I2C3 Error Interrupt                                 */
  OTGHS_EP1_OUT_IRQn          = 74,     /*!< OTGHS Endpoint 1 OUT Interrupt                       */
  OTGHS_EP1_IN_IRQn           = 75,     /*!< OTGHS Endpoint 1 IN Interrupt                        */
  OTGHS_WKUP_IRQn             = 76,     /*!< OTGHS Wake Up Interrupt linked to EXINT20            */
  OTGHS_IRQn                  = 77,     /*!< OTGHS global Interrupt                               */
  FPU_IRQn                    = 81,     /*!< FPU exception Interrupt                              */
  UART7_IRQn                  = 82,     /*!< UART7 global Interrupt                               */
  UART8_IRQn                  = 83,     /*!< UART8 global Interrupt                               */
  I2SF5_IRQn                  = 85,     /*!< I2SF5 global Interrupt                               */
  QSPI1_IRQn                  = 92,     /*!< QSPI1 global Interrupt                               */
  DMAMUX_IRQn                 = 94,     /*!< DMAMUX overflow Interrupt                            */
  ACC_IRQn                    = 103,    /*!< ACC global Interrupt                                 */
} IRQn_Type;

/**
  * @}
  */

#include "core_cm4.h"
#include "system_at32f405.h"
#include <stdint.h>

