qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F405/at32f405rx.h
#define CRM_CFG_ERTCDIV_DIV2                0x00020000U                             /*!< HEXT/2 */
#define CRM_CFG_ERTCDIV_DIV3                0x00030000U                             /*!< HEXT/3 */
#define CRM_CFG_ERTCDIV_DIV4                0x00040000U                             /*!< HEXT/4 */
#define CRM_CFG_ERTCDIV_DIV5                0x00050000U                             /*!< HEXT/5 */
#define CRM_CFG_ERTCDIV_DIV6                0x00060000U                             /*!< HEXT/6 */
#define CRM_CFG_ERTCDIV_DIV7                0x00070000U                             /*!< HEXT/7 */
#define CRM_CFG_ERTCDIV_DIV8                0x00080000U                             /*!< HEXT/8 */
#define CRM_CFG_ERTCDIV_DIV9                0x00090000U                             /*!< HEXT/9 */
#define CRM_CFG_ERTCDIV_DIV10               0x000A0000U                             /*!< HEXT/10 */
#define CRM_CFG_ERTCDIV_DIV11               0x000B0000U                             /*!< HEXT/11 */
#define CRM_CFG_ERTCDIV_DIV12               0x000C0000U                             /*!< HEXT/12 */
#define CRM_CFG_ERTCDIV_DIV13               0x000D0000U                             /*!< HEXT/13 */
#define CRM_CFG_ERTCDIV_DIV14               0x000E0000U                             /*!< HEXT/14 */
#define CRM_CFG_ERTCDIV_DIV15               0x000F0000U                             /*!< HEXT/15 */
#define CRM_CFG_ERTCDIV_DIV16               0x00100000U                             /*!< HEXT/16 */
#define CRM_CFG_ERTCDIV_DIV17               0x00110000U                             /*!< HEXT/17 */
#define CRM_CFG_ERTCDIV_DIV18               0x00120000U                             /*!< HEXT/18 */
#define CRM_CFG_ERTCDIV_DIV19               0x00130000U                             /*!< HEXT/19 */
#define CRM_CFG_ERTCDIV_DIV20               0x00140000U                             /*!< HEXT/20 */
#define CRM_CFG_ERTCDIV_DIV21               0x00150000U                             /*!< HEXT/21 */
#define CRM_CFG_ERTCDIV_DIV22               0x00160000U                             /*!< HEXT/22 */
#define CRM_CFG_ERTCDIV_DIV23               0x00170000U                             /*!< HEXT/23 */
#define CRM_CFG_ERTCDIV_DIV24               0x00180000U                             /*!< HEXT/24 */
#define CRM_CFG_ERTCDIV_DIV25               0x00190000U                             /*!< HEXT/25 */
#define CRM_CFG_ERTCDIV_DIV26               0x001A0000U                             /*!< HEXT/26 */
#define CRM_CFG_ERTCDIV_DIV27               0x001B0000U                             /*!< HEXT/27 */
#define CRM_CFG_ERTCDIV_DIV28               0x001C0000U                             /*!< HEXT/28 */
#define CRM_CFG_ERTCDIV_DIV29               0x001D0000U                             /*!< HEXT/29 */
#define CRM_CFG_ERTCDIV_DIV30               0x001E0000U                             /*!< HEXT/30 */
#define CRM_CFG_ERTCDIV_DIV31               0x001F0000U                             /*!< HEXT/31 */

/*!< I2SF5CLKSEL configuration */
#define CRM_CFG_I2SF5CLKSEL_Pos             (22U)
#define CRM_CFG_I2SF5CLKSEL_Msk             (0x3U << CRM_CFG_I2SF5CLKSEL_Pos)       /*!< 0x00C00000 */
#define CRM_CFG_I2SF5CLKSEL                 CRM_CFG_I2SF5CLKSEL_Msk                 /*!< I2SF5CLKSEL[1:0] bits (I2SF5 clock source selection) */
#define CRM_CFG_I2SF5CLKSEL_0               (0x1U << CRM_CFG_I2SF5CLKSEL_Pos)       /*!< 0x00400000 */
#define CRM_CFG_I2SF5CLKSEL_1               (0x2U << CRM_CFG_I2SF5CLKSEL_Pos)       /*!< 0x00800000 */

#define CRM_CFG_I2SF5CLKSEL_SCLK            0x00000000U                             /*!< System clock */
#define CRM_CFG_I2SF5CLKSEL_PLL             0x00400000U                             /*!< PLL */
#define CRM_CFG_I2SF5CLKSEL_HICK            0x00800000U                             /*!< HICK */
#define CRM_CFG_I2SF5CLKSEL_EXTERNAL        0x00C00000U                             /*!< External input clock */

/*!< CLKOUTDIV1 configuration */
#define CRM_CFG_CLKOUTDIV1_Pos              (27U)
#define CRM_CFG_CLKOUTDIV1_Msk              (0x7U << CRM_CFG_CLKOUTDIV1_Pos)        /*!< 0x38000000 */
#define CRM_CFG_CLKOUTDIV1                  CRM_CFG_CLKOUTDIV1_Msk                  /*!< CLKOUTDIV1[2:0] bits (Clock output division 1) */
#define CRM_CFG_CLKOUTDIV1_0                (0x1U << CRM_CFG_CLKOUTDIV1_Pos)        /*!< 0x08000000 */
#define CRM_CFG_CLKOUTDIV1_1                (0x2U << CRM_CFG_CLKOUTDIV1_Pos)        /*!< 0x10000000 */
#define CRM_CFG_CLKOUTDIV1_2                (0x4U << CRM_CFG_CLKOUTDIV1_Pos)        /*!< 0x20000000 */

#define CRM_CFG_CLKOUTDIV1_DIV1             0x00000000U                             /*!< No clock output */
#define CRM_CFG_CLKOUTDIV1_DIV2             0x20000000U                             /*!< Clock output divided by 2 */
#define CRM_CFG_CLKOUTDIV1_DIV3             0x28000000U                             /*!< Clock output divided by 3 */
#define CRM_CFG_CLKOUTDIV1_DIV4             0x30000000U                             /*!< Clock output divided by 4 */
#define CRM_CFG_CLKOUTDIV1_DIV5             0x38000000U                             /*!< Clock output divided by 5 */

/*!< CLKOUT_SEL1 configuration */
#define CRM_CFG_CLKOUT_SEL1_Pos             (30U)
#define CRM_CFG_CLKOUT_SEL1_Msk             (0x3U << CRM_CFG_CLKOUT_SEL1_Pos)       /*!< 0xC0000000 */
#define CRM_CFG_CLKOUT_SEL1                 CRM_CFG_CLKOUT_SEL1_Msk                 /*!< CLKOUT_SEL1[1:0] bits (Clock output selection 1) */
#define CRM_CFG_CLKOUT_SEL1_0               (0x1U << CRM_CFG_CLKOUT_SEL1_Pos)       /*!< 0x40000000 */
#define CRM_CFG_CLKOUT_SEL1_1               (0x2U << CRM_CFG_CLKOUT_SEL1_Pos)       /*!< 0x80000000 */

#define CRM_CFG_CLKOUT_SEL1_SCLK            0x00000000U                             /*!< System clock */
#define CRM_CFG_CLKOUT_SEL1_CLKOUT_SEL2     0x40000000U                             /*!< CLKOUT_SEL2 bit in the CRM_MISC1 register */
#define CRM_CFG_CLKOUT_SEL1_HEXT            0x80000000U                             /*!< HEXT */
#define CRM_CFG_CLKOUT_SEL1_PLL             0xC0000000U                             /*!< PLL */

/* Reference defines */
#define CRM_CFG_CLKSEL1                     CRM_CFG_CLKOUT_SEL1
#define CRM_CFG_CLKSEL1_0                   CRM_CFG_CLKOUT_SEL1_0
#define CRM_CFG_CLKSEL1_1                   CRM_CFG_CLKOUT_SEL1_1
#define CRM_CFG_CLKSEL1_SCLK                CRM_CFG_CLKOUT_SEL1_SCLK
#define CRM_CFG_CLKSEL1_CLKOUT_SEL2         CRM_CFG_CLKOUT_SEL1_CLKOUT_SEL2
#define CRM_CFG_CLKSEL1_HEXT                CRM_CFG_CLKOUT_SEL1_HEXT
#define CRM_CFG_CLKSEL1_PLL                 CRM_CFG_CLKOUT_SEL1_PLL

/*!<***************  Bit definition for CRM_CLKINT register  ******************/
#define CRM_CLKINT_LICKSTBLF_Pos            (0U)
#define CRM_CLKINT_LICKSTBLF_Msk            (0x1U << CRM_CLKINT_LICKSTBLF_Pos)      /*!< 0x00000001 */
#define CRM_CLKINT_LICKSTBLF                CRM_CLKINT_LICKSTBLF_Msk                /*!< LICK stable interrupt flag */
#define CRM_CLKINT_LEXTSTBLF_Pos            (1U)
#define CRM_CLKINT_LEXTSTBLF_Msk            (0x1U << CRM_CLKINT_LEXTSTBLF_Pos)      /*!< 0x00000002 */
#define CRM_CLKINT_LEXTSTBLF                CRM_CLKINT_LEXTSTBLF_Msk                /*!< LEXT stable flag */
#define CRM_CLKINT_HICKSTBLF_Pos            (2U)
#define CRM_CLKINT_HICKSTBLF_Msk            (0x1U << CRM_CLKINT_HICKSTBLF_Pos)      /*!< 0x00000004 */
#define CRM_CLKINT_HICKSTBLF                CRM_CLKINT_HICKSTBLF_Msk                /*!< HICK stable flag */
#define CRM_CLKINT_HEXTSTBLF_Pos            (3U)
#define CRM_CLKINT_HEXTSTBLF_Msk            (0x1U << CRM_CLKINT_HEXTSTBLF_Pos)      /*!< 0x00000008 */
#define CRM_CLKINT_HEXTSTBLF                CRM_CLKINT_HEXTSTBLF_Msk                /*!< HEXT stable flag */
#define CRM_CLKINT_PLLSTBLF_Pos             (4U)
#define CRM_CLKINT_PLLSTBLF_Msk             (0x1U << CRM_CLKINT_PLLSTBLF_Pos)       /*!< 0x00000010 */
#define CRM_CLKINT_PLLSTBLF                 CRM_CLKINT_PLLSTBLF_Msk                 /*!< PLL stable flag */
#define CRM_CLKINT_CFDF_Pos                 (7U)
#define CRM_CLKINT_CFDF_Msk                 (0x1U << CRM_CLKINT_CFDF_Pos)           /*!< 0x00000080 */
#define CRM_CLKINT_CFDF                     CRM_CLKINT_CFDF_Msk                     /*!< Clock failure detection flag */
#define CRM_CLKINT_LICKSTBLIEN_Pos          (8U)
#define CRM_CLKINT_LICKSTBLIEN_Msk          (0x1U << CRM_CLKINT_LICKSTBLIEN_Pos)    /*!< 0x00000100 */
#define CRM_CLKINT_LICKSTBLIEN              CRM_CLKINT_LICKSTBLIEN_Msk              /*!< LICK stable interrupt enable */
#define CRM_CLKINT_LEXTSTBLIEN_Pos          (9U)
#define CRM_CLKINT_LEXTSTBLIEN_Msk          (0x1U << CRM_CLKINT_LEXTSTBLIEN_Pos)    /*!< 0x00000200 */
#define CRM_CLKINT_LEXTSTBLIEN              CRM_CLKINT_LEXTSTBLIEN_Msk              /*!< LEXT stable interrupt enable */
#define CRM_CLKINT_HICKSTBLIEN_Pos          (10U)
#define CRM_CLKINT_HICKSTBLIEN_Msk          (0x1U << CRM_CLKINT_HICKSTBLIEN_Pos)    /*!< 0x00000400 */
#define CRM_CLKINT_HICKSTBLIEN              CRM_CLKINT_HICKSTBLIEN_Msk              /*!< HICK stable interrupt enable */
#define CRM_CLKINT_HEXTSTBLIEN_Pos          (11U)
#define CRM_CLKINT_HEXTSTBLIEN_Msk          (0x1U << CRM_CLKINT_HEXTSTBLIEN_Pos)    /*!< 0x00000800 */
#define CRM_CLKINT_HEXTSTBLIEN              CRM_CLKINT_HEXTSTBLIEN_Msk              /*!< HEXT stable interrupt enable */
#define CRM_CLKINT_PLLSTBLIEN_Pos           (12U)
#define CRM_CLKINT_PLLSTBLIEN_Msk           (0x1U << CRM_CLKINT_PLLSTBLIEN_Pos)     /*!< 0x00001000 */
#define CRM_CLKINT_PLLSTBLIEN               CRM_CLKINT_PLLSTBLIEN_Msk               /*!< PLL stable interrupt enable */
#define CRM_CLKINT_LICKSTBLFC_Pos           (16U)
#define CRM_CLKINT_LICKSTBLFC_Msk           (0x1U << CRM_CLKINT_LICKSTBLFC_Pos)     /*!< 0x00010000 */
#define CRM_CLKINT_LICKSTBLFC               CRM_CLKINT_LICKSTBLFC_Msk               /*!< LICK stable flag clear */
#define CRM_CLKINT_LEXTSTBLFC_Pos           (17U)
#define CRM_CLKINT_LEXTSTBLFC_Msk           (0x1U << CRM_CLKINT_LEXTSTBLFC_Pos)     /*!< 0x00020000 */
#define CRM_CLKINT_LEXTSTBLFC               CRM_CLKINT_LEXTSTBLFC_Msk               /*!< LEXT stable flag clear */
#define CRM_CLKINT_HICKSTBLFC_Pos           (18U)
#define CRM_CLKINT_HICKSTBLFC_Msk           (0x1U << CRM_CLKINT_HICKSTBLFC_Pos)     /*!< 0x00040000 */
#define CRM_CLKINT_HICKSTBLFC               CRM_CLKINT_HICKSTBLFC_Msk               /*!< HICK stable flag clear */
#define CRM_CLKINT_HEXTSTBLFC_Pos           (19U)
#define CRM_CLKINT_HEXTSTBLFC_Msk           (0x1U << CRM_CLKINT_HEXTSTBLFC_Pos)     /*!< 0x00080000 */
#define CRM_CLKINT_HEXTSTBLFC               CRM_CLKINT_HEXTSTBLFC_Msk               /*!< HEXT stable flag clear */
#define CRM_CLKINT_PLLSTBLFC_Pos            (20U)
#define CRM_CLKINT_PLLSTBLFC_Msk            (0x1U << CRM_CLKINT_PLLSTBLFC_Pos)      /*!< 0x00100000 */
#define CRM_CLKINT_PLLSTBLFC                CRM_CLKINT_PLLSTBLFC_Msk                /*!< PLL stable flag clear */
#define CRM_CLKINT_CFDFC_Pos                (23U)
#define CRM_CLKINT_CFDFC_Msk                (0x1U << CRM_CLKINT_CFDFC_Pos)          /*!< 0x00800000 */
#define CRM_CLKINT_CFDFC                    CRM_CLKINT_CFDFC_Msk                    /*!< Clock failure detection flag clear */

/*****************  Bit definition for CRM_AHBRST1 register  ******************/
#define CRM_AHBRST1_GPIOARST_Pos            (0U)
#define CRM_AHBRST1_GPIOARST_Msk            (0x1U << CRM_AHBRST1_GPIOARST_Pos)      /*!< 0x00000001 */
#define CRM_AHBRST1_GPIOARST                CRM_AHBRST1_GPIOARST_Msk                /*!< IO port A reset */
#define CRM_AHBRST1_GPIOBRST_Pos            (1U)
#define CRM_AHBRST1_GPIOBRST_Msk            (0x1U << CRM_AHBRST1_GPIOBRST_Pos)      /*!< 0x00000002 */
#define CRM_AHBRST1_GPIOBRST                CRM_AHBRST1_GPIOBRST_Msk                /*!< IO port B reset */
#define CRM_AHBRST1_GPIOCRST_Pos            (2U)
#define CRM_AHBRST1_GPIOCRST_Msk            (0x1U << CRM_AHBRST1_GPIOCRST_Pos)      /*!< 0x00000004 */
#define CRM_AHBRST1_GPIOCRST                CRM_AHBRST1_GPIOCRST_Msk                /*!< IO port C reset */
#define CRM_AHBRST1_GPIODRST_Pos            (3U)
#define CRM_AHBRST1_GPIODRST_Msk            (0x1U << CRM_AHBRST1_GPIODRST_Pos)      /*!< 0x00000008 */
#define CRM_AHBRST1_GPIODRST                CRM_AHBRST1_GPIODRST_Msk                /*!< IO port D reset */
#define CRM_AHBRST1_GPIOFRST_Pos            (5U)
#define CRM_AHBRST1_GPIOFRST_Msk            (0x1U << CRM_AHBRST1_GPIOFRST_Pos)      /*!< 0x00000020 */
#define CRM_AHBRST1_GPIOFRST                CRM_AHBRST1_GPIOFRST_Msk                /*!< IO port F reset */
#define CRM_AHBRST1_CRCRST_Pos              (12U)
#define CRM_AHBRST1_CRCRST_Msk              (0x1U << CRM_AHBRST1_CRCRST_Pos)        /*!< 0x00001000 */
#define CRM_AHBRST1_CRCRST                  CRM_AHBRST1_CRCRST_Msk                  /*!< CRC reset */
#define CRM_AHBRST1_DMA1RST_Pos             (22U)
#define CRM_AHBRST1_DMA1RST_Msk             (0x1U << CRM_AHBRST1_DMA1RST_Pos)       /*!< 0x00400000 */
#define CRM_AHBRST1_DMA1RST                 CRM_AHBRST1_DMA1RST_Msk                 /*!< DMA1 reset */
#define CRM_AHBRST1_DMA2RST_Pos             (24U)
#define CRM_AHBRST1_DMA2RST_Msk             (0x1U << CRM_AHBRST1_DMA2RST_Pos)       /*!< 0x01000000 */
#define CRM_AHBRST1_DMA2RST                 CRM_AHBRST1_DMA2RST_Msk                 /*!< DMA2 reset */
#define CRM_AHBRST1_OTGHSRST_Pos            (29U)
#define CRM_AHBRST1_OTGHSRST_Msk            (0x1U << CRM_AHBRST1_OTGHSRST_Pos)      /*!< 0x20000000 */
#define CRM_AHBRST1_OTGHSRST                CRM_AHBRST1_OTGHSRST_Msk                /*!< OTGHS reset */

