qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F405/at32f405rx.h
/*!< MUXL1 configuration */
#define GPIO_MUXL_MUXL1_Pos                 (4U)
#define GPIO_MUXL_MUXL1_Msk                 (0xFU << GPIO_MUXL_MUXL1_Pos)           /*!< 0x000000F0 */
#define GPIO_MUXL_MUXL1                     GPIO_MUXL_MUXL1_Msk                     /*!< MUXL1[3:0] bits (Multiplexed function select for GPIO x, pin 1) */
#define GPIO_MUXL_MUXL1_0                   (0x1U << GPIO_MUXL_MUXL1_Pos)           /*!< 0x00000010 */
#define GPIO_MUXL_MUXL1_1                   (0x2U << GPIO_MUXL_MUXL1_Pos)           /*!< 0x00000020 */
#define GPIO_MUXL_MUXL1_2                   (0x4U << GPIO_MUXL_MUXL1_Pos)           /*!< 0x00000040 */
#define GPIO_MUXL_MUXL1_3                   (0x8U << GPIO_MUXL_MUXL1_Pos)           /*!< 0x00000080 */

/*!< MUXL2 configuration */
#define GPIO_MUXL_MUXL2_Pos                 (8U)
#define GPIO_MUXL_MUXL2_Msk                 (0xFU << GPIO_MUXL_MUXL2_Pos)           /*!< 0x00000F00 */
#define GPIO_MUXL_MUXL2                     GPIO_MUXL_MUXL2_Msk                     /*!< MUXL2[3:0] bits (Multiplexed function select for GPIO x, pin 2) */
#define GPIO_MUXL_MUXL2_0                   (0x1U << GPIO_MUXL_MUXL2_Pos)           /*!< 0x00000100 */
#define GPIO_MUXL_MUXL2_1                   (0x2U << GPIO_MUXL_MUXL2_Pos)           /*!< 0x00000200 */
#define GPIO_MUXL_MUXL2_2                   (0x4U << GPIO_MUXL_MUXL2_Pos)           /*!< 0x00000400 */
#define GPIO_MUXL_MUXL2_3                   (0x8U << GPIO_MUXL_MUXL2_Pos)           /*!< 0x00000800 */

/*!< MUXL3 configuration */
#define GPIO_MUXL_MUXL3_Pos                 (12U)
#define GPIO_MUXL_MUXL3_Msk                 (0xFU << GPIO_MUXL_MUXL3_Pos)           /*!< 0x0000F000 */
#define GPIO_MUXL_MUXL3                     GPIO_MUXL_MUXL3_Msk                     /*!< MUXL3[3:0] bits (Multiplexed function select for GPIO x, pin 3) */
#define GPIO_MUXL_MUXL3_0                   (0x1U << GPIO_MUXL_MUXL3_Pos)           /*!< 0x00001000 */
#define GPIO_MUXL_MUXL3_1                   (0x2U << GPIO_MUXL_MUXL3_Pos)           /*!< 0x00002000 */
#define GPIO_MUXL_MUXL3_2                   (0x4U << GPIO_MUXL_MUXL3_Pos)           /*!< 0x00004000 */
#define GPIO_MUXL_MUXL3_3                   (0x8U << GPIO_MUXL_MUXL3_Pos)           /*!< 0x00008000 */

/*!< MUXL4 configuration */
#define GPIO_MUXL_MUXL4_Pos                 (16U)
#define GPIO_MUXL_MUXL4_Msk                 (0xFU << GPIO_MUXL_MUXL4_Pos)           /*!< 0x000F0000 */
#define GPIO_MUXL_MUXL4                     GPIO_MUXL_MUXL4_Msk                     /*!< MUXL4[3:0] bits (Multiplexed function select for GPIO x, pin 4) */
#define GPIO_MUXL_MUXL4_0                   (0x1U << GPIO_MUXL_MUXL4_Pos)           /*!< 0x00010000 */
#define GPIO_MUXL_MUXL4_1                   (0x2U << GPIO_MUXL_MUXL4_Pos)           /*!< 0x00020000 */
#define GPIO_MUXL_MUXL4_2                   (0x4U << GPIO_MUXL_MUXL4_Pos)           /*!< 0x00040000 */
#define GPIO_MUXL_MUXL4_3                   (0x8U << GPIO_MUXL_MUXL4_Pos)           /*!< 0x00080000 */

/*!< MUXL5 configuration */
#define GPIO_MUXL_MUXL5_Pos                 (20U)
#define GPIO_MUXL_MUXL5_Msk                 (0xFU << GPIO_MUXL_MUXL5_Pos)           /*!< 0x00F00000 */
#define GPIO_MUXL_MUXL5                     GPIO_MUXL_MUXL5_Msk                     /*!< MUXL5[3:0] bits (Multiplexed function select for GPIO x, pin 5) */
#define GPIO_MUXL_MUXL5_0                   (0x1U << GPIO_MUXL_MUXL5_Pos)           /*!< 0x00100000 */
#define GPIO_MUXL_MUXL5_1                   (0x2U << GPIO_MUXL_MUXL5_Pos)           /*!< 0x00200000 */
#define GPIO_MUXL_MUXL5_2                   (0x4U << GPIO_MUXL_MUXL5_Pos)           /*!< 0x00400000 */
#define GPIO_MUXL_MUXL5_3                   (0x8U << GPIO_MUXL_MUXL5_Pos)           /*!< 0x00800000 */

/*!< MUXL6 configuration */
#define GPIO_MUXL_MUXL6_Pos                 (24U)
#define GPIO_MUXL_MUXL6_Msk                 (0xFU << GPIO_MUXL_MUXL6_Pos)           /*!< 0x0F000000 */
#define GPIO_MUXL_MUXL6                     GPIO_MUXL_MUXL6_Msk                     /*!< MUXL6[3:0] bits (Multiplexed function select for GPIO x, pin 6) */
#define GPIO_MUXL_MUXL6_0                   (0x1U << GPIO_MUXL_MUXL6_Pos)           /*!< 0x01000000 */
#define GPIO_MUXL_MUXL6_1                   (0x2U << GPIO_MUXL_MUXL6_Pos)           /*!< 0x02000000 */
#define GPIO_MUXL_MUXL6_2                   (0x4U << GPIO_MUXL_MUXL6_Pos)           /*!< 0x04000000 */
#define GPIO_MUXL_MUXL6_3                   (0x8U << GPIO_MUXL_MUXL6_Pos)           /*!< 0x08000000 */

/*!< MUXL7 configuration */
#define GPIO_MUXL_MUXL7_Pos                 (28U)
#define GPIO_MUXL_MUXL7_Msk                 (0xFU << GPIO_MUXL_MUXL7_Pos)           /*!< 0xF0000000 */
#define GPIO_MUXL_MUXL7                     GPIO_MUXL_MUXL7_Msk                     /*!< MUXL7[3:0] bits (Multiplexed function select for GPIO x, pin 7) */
#define GPIO_MUXL_MUXL7_0                   (0x1U << GPIO_MUXL_MUXL7_Pos)           /*!< 0x10000000 */
#define GPIO_MUXL_MUXL7_1                   (0x2U << GPIO_MUXL_MUXL7_Pos)           /*!< 0x20000000 */
#define GPIO_MUXL_MUXL7_2                   (0x4U << GPIO_MUXL_MUXL7_Pos)           /*!< 0x40000000 */
#define GPIO_MUXL_MUXL7_3                   (0x8U << GPIO_MUXL_MUXL7_Pos)           /*!< 0x80000000 */

/******************  Bit definition for GPIO_MUXH register  *******************/
#define GPIO_MUXH_MUXH_Pos                  (0U)
#define GPIO_MUXH_MUXH_Msk                  (0xFFFFFFFFU << GPIO_MUXH_MUXH_Pos)     /*!< 0xFFFFFFFF */
#define GPIO_MUXH_MUXH                      GPIO_MUXH_MUXH_Msk                      /*!< Multiplexed function select for GPIO x */

/*!< MUXH8 configuration */
#define GPIO_MUXH_MUXH8_Pos                 (0U)
#define GPIO_MUXH_MUXH8_Msk                 (0xFU << GPIO_MUXH_MUXH8_Pos)           /*!< 0x0000000F */
#define GPIO_MUXH_MUXH8                     GPIO_MUXH_MUXH8_Msk                     /*!< MUXH8[3:0] bits (Multiplexed function select for GPIO x, pin 8) */
#define GPIO_MUXH_MUXH8_0                   (0x1U << GPIO_MUXH_MUXH8_Pos)           /*!< 0x00000001 */
#define GPIO_MUXH_MUXH8_1                   (0x2U << GPIO_MUXH_MUXH8_Pos)           /*!< 0x00000002 */
#define GPIO_MUXH_MUXH8_2                   (0x4U << GPIO_MUXH_MUXH8_Pos)           /*!< 0x00000004 */
#define GPIO_MUXH_MUXH8_3                   (0x8U << GPIO_MUXH_MUXH8_Pos)           /*!< 0x00000008 */

/*!< MUXH9 configuration */
#define GPIO_MUXH_MUXH9_Pos                 (4U)
#define GPIO_MUXH_MUXH9_Msk                 (0xFU << GPIO_MUXH_MUXH9_Pos)           /*!< 0x000000F0 */
#define GPIO_MUXH_MUXH9                     GPIO_MUXH_MUXH9_Msk                     /*!< MUXH9[3:0] bits (Multiplexed function select for GPIO x, pin 9) */
#define GPIO_MUXH_MUXH9_0                   (0x1U << GPIO_MUXH_MUXH9_Pos)           /*!< 0x00000010 */
#define GPIO_MUXH_MUXH9_1                   (0x2U << GPIO_MUXH_MUXH9_Pos)           /*!< 0x00000020 */
#define GPIO_MUXH_MUXH9_2                   (0x4U << GPIO_MUXH_MUXH9_Pos)           /*!< 0x00000040 */
#define GPIO_MUXH_MUXH9_3                   (0x8U << GPIO_MUXH_MUXH9_Pos)           /*!< 0x00000080 */

