qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F405/at32f405rx.h
/*******************  Bit definition for DMA_STS register  ********************/
#define DMA_STS_GF1_Pos                     (0U)
#define DMA_STS_GF1_Msk                     (0x1U << DMA_STS_GF1_Pos)               /*!< 0x00000001 */
#define DMA_STS_GF1                         DMA_STS_GF1_Msk                         /*!< Channel 1 global event flag */
#define DMA_STS_FDTF1_Pos                   (1U)
#define DMA_STS_FDTF1_Msk                   (0x1U << DMA_STS_FDTF1_Pos)             /*!< 0x00000002 */
#define DMA_STS_FDTF1                       DMA_STS_FDTF1_Msk                       /*!< Channel 1 transfer complete event flag */
#define DMA_STS_HDTF1_Pos                   (2U)
#define DMA_STS_HDTF1_Msk                   (0x1U << DMA_STS_HDTF1_Pos)             /*!< 0x00000004 */
#define DMA_STS_HDTF1                       DMA_STS_HDTF1_Msk                       /*!< Channel 1 half transfer event flag */
#define DMA_STS_DTERRF1_Pos                 (3U)
#define DMA_STS_DTERRF1_Msk                 (0x1U << DMA_STS_DTERRF1_Pos)           /*!< 0x00000008 */
#define DMA_STS_DTERRF1                     DMA_STS_DTERRF1_Msk                     /*!< Channel 1 transfer error event flag */
#define DMA_STS_GF2_Pos                     (4U)
#define DMA_STS_GF2_Msk                     (0x1U << DMA_STS_GF2_Pos)               /*!< 0x00000010 */
#define DMA_STS_GF2                         DMA_STS_GF2_Msk                         /*!< Channel 2 global event flag */
#define DMA_STS_FDTF2_Pos                   (5U)
#define DMA_STS_FDTF2_Msk                   (0x1U << DMA_STS_FDTF2_Pos)             /*!< 0x00000020 */
#define DMA_STS_FDTF2                       DMA_STS_FDTF2_Msk                       /*!< Channel 2 transfer complete event flag */
#define DMA_STS_HDTF2_Pos                   (6U)
#define DMA_STS_HDTF2_Msk                   (0x1U << DMA_STS_HDTF2_Pos)             /*!< 0x00000040 */
#define DMA_STS_HDTF2                       DMA_STS_HDTF2_Msk                       /*!< Channel 2 half transfer event flag */
#define DMA_STS_DTERRF2_Pos                 (7U)
#define DMA_STS_DTERRF2_Msk                 (0x1U << DMA_STS_DTERRF2_Pos)           /*!< 0x00000080 */
#define DMA_STS_DTERRF2                     DMA_STS_DTERRF2_Msk                     /*!< Channel 2 transfer error event flag */
#define DMA_STS_GF3_Pos                     (8U)
#define DMA_STS_GF3_Msk                     (0x1U << DMA_STS_GF3_Pos)               /*!< 0x00000100 */
#define DMA_STS_GF3                         DMA_STS_GF3_Msk                         /*!< Channel 3 global event flag */
#define DMA_STS_FDTF3_Pos                   (9U)
#define DMA_STS_FDTF3_Msk                   (0x1U << DMA_STS_FDTF3_Pos)             /*!< 0x00000200 */
#define DMA_STS_FDTF3                       DMA_STS_FDTF3_Msk                       /*!< Channel 3 transfer complete event flag */
#define DMA_STS_HDTF3_Pos                   (10U)
#define DMA_STS_HDTF3_Msk                   (0x1U << DMA_STS_HDTF3_Pos)             /*!< 0x00000400 */
#define DMA_STS_HDTF3                       DMA_STS_HDTF3_Msk                       /*!< Channel 3 half transfer event flag */
#define DMA_STS_DTERRF3_Pos                 (11U)
#define DMA_STS_DTERRF3_Msk                 (0x1U << DMA_STS_DTERRF3_Pos)           /*!< 0x00000800 */
#define DMA_STS_DTERRF3                     DMA_STS_DTERRF3_Msk                     /*!< Channel 3 transfer error event flag */
#define DMA_STS_GF4_Pos                     (12U)
#define DMA_STS_GF4_Msk                     (0x1U << DMA_STS_GF4_Pos)               /*!< 0x00001000 */
#define DMA_STS_GF4                         DMA_STS_GF4_Msk                         /*!< Channel 4 global event flag */
#define DMA_STS_FDTF4_Pos                   (13U)
#define DMA_STS_FDTF4_Msk                   (0x1U << DMA_STS_FDTF4_Pos)             /*!< 0x00002000 */
#define DMA_STS_FDTF4                       DMA_STS_FDTF4_Msk                       /*!< Channel 4 transfer complete event flag */
#define DMA_STS_HDTF4_Pos                   (14U)
#define DMA_STS_HDTF4_Msk                   (0x1U << DMA_STS_HDTF4_Pos)             /*!< 0x00004000 */
#define DMA_STS_HDTF4                       DMA_STS_HDTF4_Msk                       /*!< Channel 4 half transfer event flag */
#define DMA_STS_DTERRF4_Pos                 (15U)
#define DMA_STS_DTERRF4_Msk                 (0x1U << DMA_STS_DTERRF4_Pos)           /*!< 0x00008000 */
#define DMA_STS_DTERRF4                     DMA_STS_DTERRF4_Msk                     /*!< Channel 4 transfer error event flag */
#define DMA_STS_GF5_Pos                     (16U)
#define DMA_STS_GF5_Msk                     (0x1U << DMA_STS_GF5_Pos)               /*!< 0x00010000 */
#define DMA_STS_GF5                         DMA_STS_GF5_Msk                         /*!< Channel 5 global event flag */
#define DMA_STS_FDTF5_Pos                   (17U)
#define DMA_STS_FDTF5_Msk                   (0x1U << DMA_STS_FDTF5_Pos)             /*!< 0x00020000 */
#define DMA_STS_FDTF5                       DMA_STS_FDTF5_Msk                       /*!< Channel 5 transfer complete event flag */
#define DMA_STS_HDTF5_Pos                   (18U)
#define DMA_STS_HDTF5_Msk                   (0x1U << DMA_STS_HDTF5_Pos)             /*!< 0x00040000 */
#define DMA_STS_HDTF5                       DMA_STS_HDTF5_Msk                       /*!< Channel 5 half transfer event flag */
#define DMA_STS_DTERRF5_Pos                 (19U)
#define DMA_STS_DTERRF5_Msk                 (0x1U << DMA_STS_DTERRF5_Pos)           /*!< 0x00080000 */
#define DMA_STS_DTERRF5                     DMA_STS_DTERRF5_Msk                     /*!< Channel 5 transfer error event flag */
#define DMA_STS_GF6_Pos                     (20U)
#define DMA_STS_GF6_Msk                     (0x1U << DMA_STS_GF6_Pos)               /*!< 0x00100000 */
#define DMA_STS_GF6                         DMA_STS_GF6_Msk                         /*!< Channel 6 global event flag */
#define DMA_STS_FDTF6_Pos                   (21U)
#define DMA_STS_FDTF6_Msk                   (0x1U << DMA_STS_FDTF6_Pos)             /*!< 0x00200000 */
#define DMA_STS_FDTF6                       DMA_STS_FDTF6_Msk                       /*!< Channel 6 transfer complete event flag */
#define DMA_STS_HDTF6_Pos                   (22U)
#define DMA_STS_HDTF6_Msk                   (0x1U << DMA_STS_HDTF6_Pos)             /*!< 0x00400000 */
#define DMA_STS_HDTF6                       DMA_STS_HDTF6_Msk                       /*!< Channel 6 half transfer event flag */
#define DMA_STS_DTERRF6_Pos                 (23U)
#define DMA_STS_DTERRF6_Msk                 (0x1U << DMA_STS_DTERRF6_Pos)           /*!< 0x00800000 */
#define DMA_STS_DTERRF6                     DMA_STS_DTERRF6_Msk                     /*!< Channel 6 transfer error event flag */
#define DMA_STS_GF7_Pos                     (24U)
#define DMA_STS_GF7_Msk                     (0x1U << DMA_STS_GF7_Pos)               /*!< 0x01000000 */
#define DMA_STS_GF7                         DMA_STS_GF7_Msk                         /*!< Channel 7 global event flag */
#define DMA_STS_FDTF7_Pos                   (25U)
#define DMA_STS_FDTF7_Msk                   (0x1U << DMA_STS_FDTF7_Pos)             /*!< 0x02000000 */
#define DMA_STS_FDTF7                       DMA_STS_FDTF7_Msk                       /*!< Channel 7 transfer complete event flag */
#define DMA_STS_HDTF7_Pos                   (26U)
#define DMA_STS_HDTF7_Msk                   (0x1U << DMA_STS_HDTF7_Pos)             /*!< 0x04000000 */
#define DMA_STS_HDTF7                       DMA_STS_HDTF7_Msk                       /*!< Channel 7 half transfer event flag */
#define DMA_STS_DTERRF7_Pos                 (27U)
#define DMA_STS_DTERRF7_Msk                 (0x1U << DMA_STS_DTERRF7_Pos)           /*!< 0x08000000 */
#define DMA_STS_DTERRF7                     DMA_STS_DTERRF7_Msk                     /*!< Channel 7 transfer error event flag */

/*******************  Bit definition for DMA_CLR register  ********************/
#define DMA_CLR_GFC1_Pos                    (0U)
#define DMA_CLR_GFC1_Msk                    (0x1U << DMA_CLR_GFC1_Pos)              /*!< 0x00000001 */
#define DMA_CLR_GFC1                        DMA_CLR_GFC1_Msk                        /*!< Channel 1 global interrupt flag clear */
#define DMA_CLR_FDTFC1_Pos                  (1U)
#define DMA_CLR_FDTFC1_Msk                  (0x1U << DMA_CLR_FDTFC1_Pos)            /*!< 0x00000002 */
#define DMA_CLR_FDTFC1                      DMA_CLR_FDTFC1_Msk                      /*!< Channel 1 transfer complete flag clear */
#define DMA_CLR_HDTFC1_Pos                  (2U)
#define DMA_CLR_HDTFC1_Msk                  (0x1U << DMA_CLR_HDTFC1_Pos)            /*!< 0x00000004 */
#define DMA_CLR_HDTFC1                      DMA_CLR_HDTFC1_Msk                      /*!< Channel 1 half transfer flag clear */
#define DMA_CLR_DTERRFC1_Pos                (3U)
#define DMA_CLR_DTERRFC1_Msk                (0x1U << DMA_CLR_DTERRFC1_Pos)          /*!< 0x00000008 */
#define DMA_CLR_DTERRFC1                    DMA_CLR_DTERRFC1_Msk                    /*!< Channel 1 data transfer error flag clear */
#define DMA_CLR_GFC2_Pos                    (4U)
#define DMA_CLR_GFC2_Msk                    (0x1U << DMA_CLR_GFC2_Pos)              /*!< 0x00000010 */
#define DMA_CLR_GFC2                        DMA_CLR_GFC2_Msk                        /*!< Channel 2 global interrupt flag clear */
#define DMA_CLR_FDTFC2_Pos                  (5U)
#define DMA_CLR_FDTFC2_Msk                  (0x1U << DMA_CLR_FDTFC2_Pos)            /*!< 0x00000020 */
#define DMA_CLR_FDTFC2                      DMA_CLR_FDTFC2_Msk                      /*!< Channel 2 transfer complete flag clear */
#define DMA_CLR_HDTFC2_Pos                  (6U)
#define DMA_CLR_HDTFC2_Msk                  (0x1U << DMA_CLR_HDTFC2_Pos)            /*!< 0x00000040 */
#define DMA_CLR_HDTFC2                      DMA_CLR_HDTFC2_Msk                      /*!< Channel 2 half transfer flag clear */
#define DMA_CLR_DTERRFC2_Pos                (7U)
#define DMA_CLR_DTERRFC2_Msk                (0x1U << DMA_CLR_DTERRFC2_Pos)          /*!< 0x00000080 */
#define DMA_CLR_DTERRFC2                    DMA_CLR_DTERRFC2_Msk                    /*!< Channel 2 data transfer error flag clear */
#define DMA_CLR_GFC3_Pos                    (8U)
#define DMA_CLR_GFC3_Msk                    (0x1U << DMA_CLR_GFC3_Pos)              /*!< 0x00000100 */
#define DMA_CLR_GFC3                        DMA_CLR_GFC3_Msk                        /*!< Channel 3 global interrupt flag clear */
#define DMA_CLR_FDTFC3_Pos                  (9U)
#define DMA_CLR_FDTFC3_Msk                  (0x1U << DMA_CLR_FDTFC3_Pos)            /*!< 0x00000200 */
#define DMA_CLR_FDTFC3                      DMA_CLR_FDTFC3_Msk                      /*!< Channel 3 transfer complete flag clear */
#define DMA_CLR_HDTFC3_Pos                  (10U)
#define DMA_CLR_HDTFC3_Msk                  (0x1U << DMA_CLR_HDTFC3_Pos)            /*!< 0x00000400 */
#define DMA_CLR_HDTFC3                      DMA_CLR_HDTFC3_Msk                      /*!< Channel 3 half transfer flag clear */
#define DMA_CLR_DTERRFC3_Pos                (11U)
#define DMA_CLR_DTERRFC3_Msk                (0x1U << DMA_CLR_DTERRFC3_Pos)          /*!< 0x00000800 */
#define DMA_CLR_DTERRFC3                    DMA_CLR_DTERRFC3_Msk                    /*!< Channel 3 data transfer error flag clear */
#define DMA_CLR_GFC4_Pos                    (12U)
#define DMA_CLR_GFC4_Msk                    (0x1U << DMA_CLR_GFC4_Pos)              /*!< 0x00001000 */
#define DMA_CLR_GFC4                        DMA_CLR_GFC4_Msk                        /*!< Channel 4 global interrupt flag clear */
#define DMA_CLR_FDTFC4_Pos                  (13U)
#define DMA_CLR_FDTFC4_Msk                  (0x1U << DMA_CLR_FDTFC4_Pos)            /*!< 0x00002000 */
#define DMA_CLR_FDTFC4                      DMA_CLR_FDTFC4_Msk                      /*!< Channel 4 transfer complete flag clear */
#define DMA_CLR_HDTFC4_Pos                  (14U)
#define DMA_CLR_HDTFC4_Msk                  (0x1U << DMA_CLR_HDTFC4_Pos)            /*!< 0x00004000 */
#define DMA_CLR_HDTFC4                      DMA_CLR_HDTFC4_Msk                      /*!< Channel 4 half transfer flag clear */
#define DMA_CLR_DTERRFC4_Pos                (15U)
#define DMA_CLR_DTERRFC4_Msk                (0x1U << DMA_CLR_DTERRFC4_Pos)          /*!< 0x00008000 */
#define DMA_CLR_DTERRFC4                    DMA_CLR_DTERRFC4_Msk                    /*!< Channel 4 data transfer error flag clear */
#define DMA_CLR_GFC5_Pos                    (16U)
#define DMA_CLR_GFC5_Msk                    (0x1U << DMA_CLR_GFC5_Pos)              /*!< 0x00010000 */
#define DMA_CLR_GFC5                        DMA_CLR_GFC5_Msk                        /*!< Channel 5 global interrupt flag clear */
#define DMA_CLR_FDTFC5_Pos                  (17U)
#define DMA_CLR_FDTFC5_Msk                  (0x1U << DMA_CLR_FDTFC5_Pos)            /*!< 0x00020000 */
#define DMA_CLR_FDTFC5                      DMA_CLR_FDTFC5_Msk                      /*!< Channel 5 transfer complete flag clear */
#define DMA_CLR_HDTFC5_Pos                  (18U)
#define DMA_CLR_HDTFC5_Msk                  (0x1U << DMA_CLR_HDTFC5_Pos)            /*!< 0x00040000 */
#define DMA_CLR_HDTFC5                      DMA_CLR_HDTFC5_Msk                      /*!< Channel 5 half transfer flag clear */
#define DMA_CLR_DTERRFC5_Pos                (19U)
#define DMA_CLR_DTERRFC5_Msk                (0x1U << DMA_CLR_DTERRFC5_Pos)          /*!< 0x00080000 */
#define DMA_CLR_DTERRFC5                    DMA_CLR_DTERRFC5_Msk                    /*!< Channel 5 data transfer error flag clear */
#define DMA_CLR_GFC6_Pos                    (20U)
#define DMA_CLR_GFC6_Msk                    (0x1U << DMA_CLR_GFC6_Pos)              /*!< 0x00100000 */
#define DMA_CLR_GFC6                        DMA_CLR_GFC6_Msk                        /*!< Channel 6 global interrupt flag clear */
#define DMA_CLR_FDTFC6_Pos                  (21U)
#define DMA_CLR_FDTFC6_Msk                  (0x1U << DMA_CLR_FDTFC6_Pos)            /*!< 0x00200000 */
#define DMA_CLR_FDTFC6                      DMA_CLR_FDTFC6_Msk                      /*!< Channel 6 transfer complete flag clear */
#define DMA_CLR_HDTFC6_Pos                  (22U)
#define DMA_CLR_HDTFC6_Msk                  (0x1U << DMA_CLR_HDTFC6_Pos)            /*!< 0x00400000 */
#define DMA_CLR_HDTFC6                      DMA_CLR_HDTFC6_Msk                      /*!< Channel 6 half transfer flag clear */
#define DMA_CLR_DTERRFC6_Pos                (23U)
#define DMA_CLR_DTERRFC6_Msk                (0x1U << DMA_CLR_DTERRFC6_Pos)          /*!< 0x00800000 */
#define DMA_CLR_DTERRFC6                    DMA_CLR_DTERRFC6_Msk                    /*!< Channel 6 data transfer error flag clear */
#define DMA_CLR_GFC7_Pos                    (24U)
#define DMA_CLR_GFC7_Msk                    (0x1U << DMA_CLR_GFC7_Pos)              /*!< 0x01000000 */
#define DMA_CLR_GFC7                        DMA_CLR_GFC7_Msk                        /*!< Channel 7 global interrupt flag clear */
#define DMA_CLR_FDTFC7_Pos                  (25U)
#define DMA_CLR_FDTFC7_Msk                  (0x1U << DMA_CLR_FDTFC7_Pos)            /*!< 0x02000000 */
#define DMA_CLR_FDTFC7                      DMA_CLR_FDTFC7_Msk                      /*!< Channel 7 transfer complete flag clear */
#define DMA_CLR_HDTFC7_Pos                  (26U)
#define DMA_CLR_HDTFC7_Msk                  (0x1U << DMA_CLR_HDTFC7_Pos)            /*!< 0x04000000 */
#define DMA_CLR_HDTFC7                      DMA_CLR_HDTFC7_Msk                      /*!< Channel 7 half transfer flag clear */
#define DMA_CLR_DTERRFC7_Pos                (27U)
#define DMA_CLR_DTERRFC7_Msk                (0x1U << DMA_CLR_DTERRFC7_Pos)          /*!< 0x08000000 */
#define DMA_CLR_DTERRFC7                    DMA_CLR_DTERRFC7_Msk                    /*!< Channel 7 data transfer error flag clear */

/******************  Bit definition for DMA_CCTRL register  *******************/
#define DMA_CCTRL_CHEN_Pos                  (0U)
#define DMA_CCTRL_CHEN_Msk                  (0x1U << DMA_CCTRL_CHEN_Pos)            /*!< 0x00000001 */
#define DMA_CCTRL_CHEN                      DMA_CCTRL_CHEN_Msk                      /*!< Channel enable */
#define DMA_CCTRL_FDTIEN_Pos                (1U)
#define DMA_CCTRL_FDTIEN_Msk                (0x1U << DMA_CCTRL_FDTIEN_Pos)          /*!< 0x00000002 */
#define DMA_CCTRL_FDTIEN                    DMA_CCTRL_FDTIEN_Msk                    /*!< Transfer complete interrupt enable */
#define DMA_CCTRL_HDTIEN_Pos                (2U)
#define DMA_CCTRL_HDTIEN_Msk                (0x1U << DMA_CCTRL_HDTIEN_Pos)          /*!< 0x00000004 */
#define DMA_CCTRL_HDTIEN                    DMA_CCTRL_HDTIEN_Msk                    /*!< Half-transfer interrupt enable */
#define DMA_CCTRL_DTERRIEN_Pos              (3U)
#define DMA_CCTRL_DTERRIEN_Msk              (0x1U << DMA_CCTRL_DTERRIEN_Pos)        /*!< 0x00000008 */
#define DMA_CCTRL_DTERRIEN                  DMA_CCTRL_DTERRIEN_Msk                  /*!< Data transfer error interrupt enable */
#define DMA_CCTRL_DTD_Pos                   (4U)
#define DMA_CCTRL_DTD_Msk                   (0x1U << DMA_CCTRL_DTD_Pos)             /*!< 0x00000010 */
#define DMA_CCTRL_DTD                       DMA_CCTRL_DTD_Msk                       /*!< Data transfer direction */
#define DMA_CCTRL_LM_Pos                    (5U)
#define DMA_CCTRL_LM_Msk                    (0x1U << DMA_CCTRL_LM_Pos)              /*!< 0x00000020 */
#define DMA_CCTRL_LM                        DMA_CCTRL_LM_Msk                        /*!< Circular mode */
#define DMA_CCTRL_PINCM_Pos                 (6U)
#define DMA_CCTRL_PINCM_Msk                 (0x1U << DMA_CCTRL_PINCM_Pos)           /*!< 0x00000040 */
#define DMA_CCTRL_PINCM                     DMA_CCTRL_PINCM_Msk                     /*!< Peripheral address increment mode */
#define DMA_CCTRL_MINCM_Pos                 (7U)
#define DMA_CCTRL_MINCM_Msk                 (0x1U << DMA_CCTRL_MINCM_Pos)           /*!< 0x00000080 */
#define DMA_CCTRL_MINCM                     DMA_CCTRL_MINCM_Msk                     /*!< Memory address increment mode */

/*!< PWIDTH configuration */
#define DMA_CCTRL_PWIDTH_Pos                (8U)
#define DMA_CCTRL_PWIDTH_Msk                (0x3U << DMA_CCTRL_PWIDTH_Pos)          /*!< 0x00000300 */
#define DMA_CCTRL_PWIDTH                    DMA_CCTRL_PWIDTH_Msk                    /*!< PWIDTH[1:0] bits (Peripheral data bit width) */
#define DMA_CCTRL_PWIDTH_0                  (0x1U << DMA_CCTRL_PWIDTH_Pos)          /*!< 0x00000100 */
#define DMA_CCTRL_PWIDTH_1                  (0x2U << DMA_CCTRL_PWIDTH_Pos)          /*!< 0x00000200 */

/*!< MWIDTH configuration */
#define DMA_CCTRL_MWIDTH_Pos                (10U)
#define DMA_CCTRL_MWIDTH_Msk                (0x3U << DMA_CCTRL_MWIDTH_Pos)          /*!< 0x00000C00 */
#define DMA_CCTRL_MWIDTH                    DMA_CCTRL_MWIDTH_Msk                    /*!< MWIDTH[1:0] bits (Memory data bit width) */
#define DMA_CCTRL_MWIDTH_0                  (0x1U << DMA_CCTRL_MWIDTH_Pos)          /*!< 0x00000400 */
#define DMA_CCTRL_MWIDTH_1                  (0x2U << DMA_CCTRL_MWIDTH_Pos)          /*!< 0x00000800 */

/*!< CHPL configuration */
#define DMA_CCTRL_CHPL_Pos                  (12U)
#define DMA_CCTRL_CHPL_Msk                  (0x3U << DMA_CCTRL_CHPL_Pos)            /*!< 0x00003000 */
#define DMA_CCTRL_CHPL                      DMA_CCTRL_CHPL_Msk                      /*!< CHPL[1:0] bits(Channel priority level) */
#define DMA_CCTRL_CHPL_0                    (0x1U << DMA_CCTRL_CHPL_Pos)            /*!< 0x00001000 */
#define DMA_CCTRL_CHPL_1                    (0x2U << DMA_CCTRL_CHPL_Pos)            /*!< 0x00002000 */

#define DMA_CCTRL_M2M_Pos                   (14U)
#define DMA_CCTRL_M2M_Msk                   (0x1U << DMA_CCTRL_M2M_Pos)             /*!< 0x00004000 */
#define DMA_CCTRL_M2M                       DMA_CCTRL_M2M_Msk                       /*!< Memory to memory mode */

/******************  Bit definition for DMA_CDTCNT register  ******************/
#define DMA_CDTCNT_CNT_Pos                  (0U)
#define DMA_CDTCNT_CNT_Msk                  (0xFFFFU << DMA_CDTCNT_CNT_Pos)         /*!< 0x0000FFFF */
#define DMA_CDTCNT_CNT                      DMA_CDTCNT_CNT_Msk                      /*!< Number of data to transfer */

