qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F405/at32f405rx.h
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_SERIAL  0x00000000U                             /*!< Serial mode (1-1-1) */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_DUAL    0x00000100U                             /*!< Dual-wire mode (1-1-2) */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_QUAD    0x00000200U                             /*!< Quad mode (1-1-4) */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_DUALIO  0x00000300U                             /*!< Dual-wire I/O mode (1-2-2) */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_QUADIO  0x00000400U                             /*!< Quad I/O mode (1-4-4) */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_DPI     0x00000500U                             /*!< DPI mode (2-2-2) */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_QPI     0x00000600U                             /*!< QPI mode (4-4-4) */

#define QSPI_XIP_CMD_W1_XIPW_ADRLEN_Pos     (11U)                                   /*!< 0x00000800 */
#define QSPI_XIP_CMD_W1_XIPW_ADRLEN_Msk     (0x1U << QSPI_XIP_CMD_W1_XIPW_ADRLEN_Pos)
#define QSPI_XIP_CMD_W1_XIPW_ADRLEN         QSPI_XIP_CMD_W1_XIPW_ADRLEN_Msk         /*!< XIP write address length */
#define QSPI_XIP_CMD_W1_XIPW_INSC_Pos       (12U)                                   /*!< 0x000FF000 */
#define QSPI_XIP_CMD_W1_XIPW_INSC_Msk       (0xFFU << QSPI_XIP_CMD_W1_XIPW_INSC_Pos)
#define QSPI_XIP_CMD_W1_XIPW_INSC           QSPI_XIP_CMD_W1_XIPW_INSC_Msk           /*!< XIP write instruction code */

/***************  Bit definition for QSPI_XIP_CMD_W2 register  ****************/
#define QSPI_XIP_CMD_W2_XIPR_DCNT_Pos       (0U)                                    /*!< 0x0000003F */
#define QSPI_XIP_CMD_W2_XIPR_DCNT_Msk       (0x3FU << QSPI_XIP_CMD_W2_XIPR_DCNT_Pos)
#define QSPI_XIP_CMD_W2_XIPR_DCNT           QSPI_XIP_CMD_W2_XIPR_DCNT_Msk           /*!< Indicates the time counter to judge maximum data count in mode D */
#define QSPI_XIP_CMD_W2_XIPR_TCNT_Pos       (8U)                                    /*!< 0x00007F00 */
#define QSPI_XIP_CMD_W2_XIPR_TCNT_Msk       (0x7FU << QSPI_XIP_CMD_W2_XIPR_TCNT_Pos)
#define QSPI_XIP_CMD_W2_XIPR_TCNT           QSPI_XIP_CMD_W2_XIPR_TCNT_Msk           /*!< Indicates the time counter to judge time interval in mode T */
#define QSPI_XIP_CMD_W2_XIPR_SEL_Pos        (15U)
#define QSPI_XIP_CMD_W2_XIPR_SEL_Msk        (0x1U << QSPI_XIP_CMD_W2_XIPR_SEL_Pos)  /*!< 0x00008000 */
#define QSPI_XIP_CMD_W2_XIPR_SEL            QSPI_XIP_CMD_W2_XIPR_SEL_Msk            /*!< XIP read mode select */
#define QSPI_XIP_CMD_W2_XIPW_DCNT_Pos       (16U)                                   /*!< 0x003F0000 */
#define QSPI_XIP_CMD_W2_XIPW_DCNT_Msk       (0x3FU << QSPI_XIP_CMD_W2_XIPW_DCNT_Pos)
#define QSPI_XIP_CMD_W2_XIPW_DCNT           QSPI_XIP_CMD_W2_XIPW_DCNT_Msk           /*!< Indicates the time counter to judge maximum data count in mode D */
#define QSPI_XIP_CMD_W2_XIPW_TCNT_Pos       (24U)                                   /*!< 0x7F000000 */
#define QSPI_XIP_CMD_W2_XIPW_TCNT_Msk       (0x7FU << QSPI_XIP_CMD_W2_XIPW_TCNT_Pos)
#define QSPI_XIP_CMD_W2_XIPW_TCNT           QSPI_XIP_CMD_W2_XIPW_TCNT_Msk           /*!< Indicates the time counter to judge time interval in mode T */
#define QSPI_XIP_CMD_W2_XIPW_SEL_Pos        (31U)
#define QSPI_XIP_CMD_W2_XIPW_SEL_Msk        (0x1U << QSPI_XIP_CMD_W2_XIPW_SEL_Pos)  /*!< 0x80000000 */
#define QSPI_XIP_CMD_W2_XIPW_SEL            QSPI_XIP_CMD_W2_XIPW_SEL_Msk            /*!< XIP write mode select */

/***************  Bit definition for QSPI_XIP_CMD_W3 register  ****************/
#define QSPI_XIP_CMD_W3_BYPASSC_Pos         (0U)
#define QSPI_XIP_CMD_W3_BYPASSC_Msk         (0x1U << QSPI_XIP_CMD_W3_BYPASSC_Pos)   /*!< 0x00000001 */
#define QSPI_XIP_CMD_W3_BYPASSC             QSPI_XIP_CMD_W3_BYPASSC_Msk             /*!< Bypass cache function */
#define QSPI_XIP_CMD_W3_CSTS_Pos            (3U)
#define QSPI_XIP_CMD_W3_CSTS_Msk            (0x1U << QSPI_XIP_CMD_W3_CSTS_Pos)      /*!< 0x00000008 */
#define QSPI_XIP_CMD_W3_CSTS                QSPI_XIP_CMD_W3_CSTS_Msk                /*!< Cache status */

/******************  Bit definition for QSPI_CTRL3 register  ******************/
#define QSPI_CTRL3_ISPC_Pos                 (8U)
#define QSPI_CTRL3_ISPC_Msk                 (0x1U << QSPI_CTRL3_ISPC_Pos)           /*!< 0x00000100 */
#define QSPI_CTRL3_ISPC                     QSPI_CTRL3_ISPC_Msk                     /*!< ISPC */

/*******************  Bit definition for QSPI_REV register  *******************/
#define QSPI_REV_REV_Pos                    (0U)
#define QSPI_REV_REV_Msk                    (0xFFFFFFFFU << QSPI_REV_REV_Pos)       /*!< 0xFFFFFFFF */
#define QSPI_REV_REV                        QSPI_REV_REV_Msk                        /*!< Indicates IP version */

/*******************  Bit definition for QSPI_DT register  ********************/
#define QSPI_DT_DT_Pos                      (0U)
#define QSPI_DT_DT_Msk                      (0xFFFFFFFFU << QSPI_DT_DT_Pos)         /*!< 0xFFFFFFFF */
#define QSPI_DT_DT                          QSPI_DT_DT_Msk                          /*!< Data port register */

/******************************************************************************/
/*                                                                            */
/*                             Debug MCU (DEBUG)                              */
/*                                                                            */
/******************************************************************************/

/*****************  Bit definition for DEBUG_IDCODE register  *****************/
/*!< PID congiguration */
#define DEBUG_IDCODE_PID_Pos                (0U)
#define DEBUG_IDCODE_PID_Msk                (0xFFFFFFFFU << DEBUG_IDCODE_PID_Pos)   /*!< 0xFFFFFFFF */
#define DEBUG_IDCODE_PID                    DEBUG_IDCODE_PID_Msk                    /*!< PID[31:0] bits (PID information) */
#define DEBUG_IDCODE_PID_0                  (0x00000001U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000001 */
#define DEBUG_IDCODE_PID_1                  (0x00000002U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000002 */
#define DEBUG_IDCODE_PID_2                  (0x00000004U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000004 */
#define DEBUG_IDCODE_PID_3                  (0x00000008U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000008 */
#define DEBUG_IDCODE_PID_4                  (0x00000010U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000010 */
#define DEBUG_IDCODE_PID_5                  (0x00000020U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000020 */
#define DEBUG_IDCODE_PID_6                  (0x00000040U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000040 */
#define DEBUG_IDCODE_PID_7                  (0x00000080U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000080 */
#define DEBUG_IDCODE_PID_8                  (0x00000100U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000100 */
#define DEBUG_IDCODE_PID_9                  (0x00000200U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000200 */
#define DEBUG_IDCODE_PID_10                 (0x00000400U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000400 */
#define DEBUG_IDCODE_PID_11                 (0x00000800U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000800 */
#define DEBUG_IDCODE_PID_12                 (0x00001000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00001000 */
#define DEBUG_IDCODE_PID_13                 (0x00002000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00002000 */
#define DEBUG_IDCODE_PID_14                 (0x00004000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00004000 */
#define DEBUG_IDCODE_PID_15                 (0x00008000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00008000 */
#define DEBUG_IDCODE_PID_16                 (0x00010000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00010000 */
#define DEBUG_IDCODE_PID_17                 (0x00020000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00020000 */
#define DEBUG_IDCODE_PID_18                 (0x00040000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00040000 */
#define DEBUG_IDCODE_PID_19                 (0x00080000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00080000 */
#define DEBUG_IDCODE_PID_20                 (0x00100000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00100000 */
#define DEBUG_IDCODE_PID_21                 (0x00200000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00200000 */
#define DEBUG_IDCODE_PID_22                 (0x00400000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00400000 */
#define DEBUG_IDCODE_PID_23                 (0x00800000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00800000 */
#define DEBUG_IDCODE_PID_24                 (0x01000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x01000000 */
#define DEBUG_IDCODE_PID_25                 (0x02000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x02000000 */
#define DEBUG_IDCODE_PID_26                 (0x04000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x04000000 */
#define DEBUG_IDCODE_PID_27                 (0x08000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x08000000 */
#define DEBUG_IDCODE_PID_28                 (0x10000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x10000000 */
#define DEBUG_IDCODE_PID_29                 (0x20000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x20000000 */
#define DEBUG_IDCODE_PID_30                 (0x40000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x40000000 */
#define DEBUG_IDCODE_PID_31                 (0x80000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x80000000 */

/******************  Bit definition for DEBUG_CTRL register  ******************/
#define DEBUG_CTRL_SLEEP_DEBUG_Pos          (0U)
#define DEBUG_CTRL_SLEEP_DEBUG_Msk          (0x1U << DEBUG_CTRL_SLEEP_DEBUG_Pos)    /*!< 0x00000001 */
#define DEBUG_CTRL_SLEEP_DEBUG              DEBUG_CTRL_SLEEP_DEBUG_Msk              /*!< Debug Sleep mode control bit */
#define DEBUG_CTRL_DEEPSLEEP_DEBUG_Pos      (1U)                                    /*!< 0x00000002 */
#define DEBUG_CTRL_DEEPSLEEP_DEBUG_Msk      (0x1U << DEBUG_CTRL_DEEPSLEEP_DEBUG_Pos)
#define DEBUG_CTRL_DEEPSLEEP_DEBUG          DEBUG_CTRL_DEEPSLEEP_DEBUG_Msk          /*!< Debug Deep sleep mode control bit */
#define DEBUG_CTRL_STANDBY_DEBUG_Pos        (2U)
#define DEBUG_CTRL_STANDBY_DEBUG_Msk        (0x1U << DEBUG_CTRL_STANDBY_DEBUG_Pos)  /*!< 0x00000004 */
#define DEBUG_CTRL_STANDBY_DEBUG            DEBUG_CTRL_STANDBY_DEBUG_Msk            /*!< Debug Standby mode control bit */

